const data = {
  patientList: {
    name: '胡定明', //姓名
    sex: '男', //性别
    age: '65', //年龄
    endemicName: '心内科', //科室
    bedNo: '123', //床号
    inpNo: 'Z23456', //住院号
  }, //病人信息
  beginDate: '2017-06-28', //开始时间,按今天倒推7天
  dayList: ['1', '2', '3', '4', '5', '6', '7'], //住院天数 共七条，没有的那天数据返回''
  dayOps: ['1', '2', '3', '4', '5', '6', '7'], //产后/术后天数 共七条，没有的那天数据返回''
  breathingList: [
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
    '60',
    '70',
    '65',
    '66',
    '56',
    '60',
    '70',
  ], //呼吸 42条数据 某个时间点空值返回''
  xyList: ['60', '70', '65', '66', '56', '60', '70', '60', '70', '65', '66', '56', '60', '70'], //血压 14条，当天空值返回''
  dayMap: {
    "{name:'入量',units:'ml'}": ['', '', '', '', '', '44', ''], //7条数据对应7天的入量
    "{name:'出量',units:'ml'}": ['', '', '', '', '', '44', ''], //以此类推...
    "{name:'小便',units:'ml'}": ['', '', '', '', '', '44', ''],
    "{name:'大便',units:'次/日'}": ['', '', '', '', '', '44', ''],
    "{name:'体重',units:'kg'}": ['', '', '', '', '', '47.5', ''],
    "{name:'血氧饱和度',units:''}": ['', '', '', '', '', '47.5', ''],
    "{name:'过敏史',units:''}": ['', '', '', '', '', '47.5', ''],
  }, //每日录入信息
  pointTime: {
    // 脉搏
    mb: [
      {
        dataTime: '2017-06-28 22:00:00',
        date: '2017-06-28',
        hour: 22,
        mbValue: '',
        phValue: '',
        type: '',
        value: '88',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 06:00:00',
        date: '2017-06-29',
        hour: 6,
        mbValue: '',
        phValue: '',
        type: '',
        value: '160',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 14:00:00',
        date: '2017-06-29',
        hour: 14,
        mbValue: '',
        phValue: '',
        type: '',
        value: '100',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 18:00:00',
        date: '2017-06-29',
        hour: 18,
        mbValue: '',
        phValue: '',
        type: '',
        value: '120',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 22:00:00',
        date: '2017-06-29',
        hour: 22,
        mbValue: '',
        phValue: '',
        type: '',
        value: '150',
        xlValue: '',
      },
    ],
    // 温度
    wd: [
      {
        dataTime: '2017-06-29 22:00:00',
        date: '2017-06-28',
        hour: 22,
        mbValue: '',
        phValue: '36.5',
        type: 'ew', // 耳温
        value: '37.2',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 06:00:00',
        date: '2017-06-29',
        hour: 6,
        mbValue: '',
        phValue: '',
        type: 'ew', // 耳温
        value: '37',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 14:00:00',
        date: '2017-06-29',
        hour: 14,
        mbValue: '',
        phValue: '',
        type: 'ew', // 耳温
        value: '37.5',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 18:00:00',
        date: '2017-06-29',
        hour: 18,
        mbValue: '',
        phValue: '',
        type: 'ew', // 耳温
        value: '37.4',
        xlValue: '',
      },
      {
        dataTime: '2017-06-29 22:00:00',
        date: '2017-06-29',
        hour: 22,
        mbValue: '',
        phValue: '',
        type: 'ew', // 耳温
        value: '36.8',
        xlValue: '',
      },
    ],
  }, // 时间段录入信息
};
